# Pandas !!


![Pandas](https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/01/31/14/panda-bamboo.jpg)


#### Além desses animaizinhos simpáticos, também é o nome de uma biblioteca Open Source para Python, provavelmente a mais utilizada para DataScience no mundo todo!

#### Ela traz ferramentas de análise e manipulação de dados de alta performance e fáceis de usar.

#### Seu principal componetes são os chamados DataFrames, que vamos trabalhar nesse notebook

#### Links interessantes:

    Documentação:

https://pandas.pydata.org/pandas-docs/stable/

    Link com algumas dicas:

https://nbviewer.jupyter.org/github/donnemartin/data-science-ipython-notebooks/blob/master/pandas/pandas.ipynb

# Introdução aos Pandas

O pandas é como uma versão extremamente poderosa do Excel, com muito mais recursos.

# DataFrames

DataFrame é o elemeto mais importante dos Pandas. Eles são como uma tabela do excel.

In [29]:
import numpy as np
import pandas as pd

pd.options.mode.chained_assignment = None  # default='warn'

In [ ]:
pd.<tab>

In [4]:
pd.DataFrame?

In [5]:
lista = [
    ['Jake', 'Cachorro', 10],
    ['Finn', 'Humano', 10],
    ['Bubblegum', 'Doce', 8],
    ['Marceline', 'Vampira', 8],
    ['Lich', 'Demônio', 5],
    ['Ice King', 'Humano', 5]
]

In [16]:
#Criando nosso dataframe
df = pd.DataFrame(lista)
df

           0         1   2
0       Jake  Cachorro  10
1       Finn    Humano  10
2  Bubblegum      Doce   8
3  Marceline   Vampira   8
4       Lich   Demônio   5
5   Ice King      Mago   5

In [17]:
df = pd.DataFrame(lista, columns=['Nome', 'Classe', 'Pontos'])
df

        Nome    Classe  Pontos
0       Jake  Cachorro      10
1       Finn    Humano      10
2  Bubblegum      Doce       8
3  Marceline   Vampira       8
4       Lich   Demônio       5
5   Ice King      Mago       5

In [18]:
df.set_index('Pontos')

             Nome    Classe
Pontos
10           Jake  Cachorro
10           Finn    Humano
8       Bubblegum      Doce
8       Marceline   Vampira
5            Lich   Demônio
5        Ice King      Mago

In [20]:
df.set_index('Pontos', inplace=True)

#Ou

# df = df.set_index('Relevância')

df

             Nome    Classe
Pontos
10           Jake  Cachorro
10           Finn    Humano
8       Bubblegum      Doce
8       Marceline   Vampira
5            Lich   Demônio
5        Ice King      Mago

In [21]:
# Para remover
df.reset_index(inplace=True)
df

   Pontos       Nome    Classe
0      10       Jake  Cachorro
1      10       Finn    Humano
2       8  Bubblegum      Doce
3       8  Marceline   Vampira
4       5       Lich   Demônio
5       5   Ice King      Mago

In [23]:
#Como faço para reordenar as colunas?

df.columns

Index(['Pontos', 'Nome', 'Classe'], dtype='object')

In [26]:
#Simplesmente selecionar o DF com as colunas na ordem desejada

col = ['Nome', 'Classe', 'Pontos']

# então passamos a nova ordem para o DataFrame:

df = df[col]
df

        Nome    Classe  Pontos
0       Jake  Cachorro      10
1       Finn    Humano      10
2  Bubblegum      Doce       8
3  Marceline   Vampira       8
4       Lich   Demônio       5
5   Ice King      Mago       5

In [30]:
#Adicionando uma nova coluna
gênero = ['M', 'M', 'F', 'F', 'M', 'M']
df['Gênero'] = gênero

In [32]:
df

        Nome    Classe  Pontos Gênero
0       Jake  Cachorro      10      M
1       Finn    Humano      10      M
2  Bubblegum      Doce       8      F
3  Marceline   Vampira       8      F
4       Lich   Demônio       5      M
5   Ice King      Mago       5      M

In [33]:
#Adicionando uma nova linha
linha = ['Fire Princess', 'Living-Fire', 3, 'F']

In [37]:
df.loc[len(df), :] = linha
df

            Nome       Classe  Pontos Gênero
0           Jake     Cachorro    10.0      M
1           Finn       Humano    10.0      M
2      Bubblegum         Doce     8.0      F
3      Marceline      Vampira     8.0      F
4           Lich      Demônio     5.0      M
5       Ice King         Mago     5.0      M
6  Fire Princess  Living-Fire     3.0      F

## Seleção e indexação

Vamos aprender os vários métodos para pegar dados de um DataFrame

In [38]:
#Selecionando uma Coluna
df['Classe']

0       Cachorro
1         Humano
2           Doce
3        Vampira
4        Demônio
5           Mago
6    Living-Fire
Name: Classe, dtype: object

In [39]:
#Selecionando mais de uma Coluna
df[['Classe', 'Gênero']]

        Classe Gênero
0     Cachorro      M
1       Humano      M
2         Doce      F
3      Vampira      F
4      Demônio      M
5         Mago      M
6  Living-Fire      F

In [40]:
#Selecionando uma linha
df.loc[2]

Nome      Bubblegum
Classe         Doce
Pontos            8
Gênero            F
Name: 2, dtype: object

In [41]:
#Selecionando mais de uma linha usando Slicing
df.iloc[4:]

            Nome       Classe  Pontos Gênero
4           Lich      Demônio     5.0      M
5       Ice King         Mago     5.0      M
6  Fire Princess  Living-Fire     3.0      F

In [42]:
#Selecionando mais de uma linha usando Slicing
df.iloc[2:5]

        Nome   Classe  Pontos Gênero
2  Bubblegum     Doce     8.0      F
3  Marceline  Vampira     8.0      F
4       Lich  Demônio     5.0      M

In [43]:
#Selecionando um pedaço de coluna e um pedaço de linha ao mesmo tempo

#Dataframe.loc[['linhas'], ['colunas']]

df.loc[[1,2],['Nome','Classe']]

        Nome  Classe
1       Finn  Humano
2  Bubblegum    Doce

### Diferença loc e iloc
    loc gets rows (or columns) with particular labels from the index.
    iloc gets rows (or columns) at particular positions in the index (so it only takes integers).
    
Referência: (https://stackoverflow.com/questions/31593201/how-are-iloc-ix-and-loc-different)

In [51]:
df

            Nome       Classe  Pontos Gênero
0           Jake     Cachorro    10.0      M
1           Finn       Humano    10.0      M
2      Bubblegum         Doce     8.0      F
3      Marceline      Vampira     8.0      F
4           Lich      Demônio     5.0      M
5       Ice King         Mago     5.0      M
6  Fire Princess  Living-Fire     3.0      F

In [49]:
df.loc[5]

Nome      Ice King
Classe        Mago
Pontos           5
Gênero           M
Name: 5, dtype: object

In [50]:
df.iloc[5]

Nome      Ice King
Classe        Mago
Pontos           5
Gênero           M
Name: 5, dtype: object

In [52]:
df.set_index('Pontos')

                 Nome       Classe Gênero
Pontos
10.0             Jake     Cachorro      M
10.0             Finn       Humano      M
8.0         Bubblegum         Doce      F
8.0         Marceline      Vampira      F
5.0              Lich      Demônio      M
5.0          Ice King         Mago      M
3.0     Fire Princess  Living-Fire      F

In [47]:
df.set_index('Pontos').iloc[5]

Nome      Ice King
Classe        Mago
Gênero           M
Name: 5.0, dtype: object

In [48]:
df.set_index('Pontos').loc[5]

            Nome   Classe Gênero
Pontos
5.0         Lich  Demônio      M
5.0     Ice King     Mago      M

#### Mais exemplos

In [66]:
exemplo = pd.DataFrame(np.linspace(1,10,10),  
                       index=['a','b','c','d','e', 1, 2, 3, 4, 5], 
                       columns=['Valores'])
exemplo

   Valores
a      1.0
b      2.0
c      3.0
d      4.0
e      5.0
1      6.0
2      7.0
3      8.0
4      9.0
5     10.0

In [68]:
exemplo.iloc[4]

Valores    5.0
Name: e, dtype: float64

In [69]:
exemplo.loc[4]

Valores    9.0
Name: 4, dtype: float64

In [70]:
try:
    print(exemplo.loc['d'])
except:
    print('erro')

Valores    4.0
Name: d, dtype: float64

In [71]:
try:
    print(exemplo.iloc['d'])
except:
    print('erro')

erro

#### Criando uma coluna com base em outra:

In [73]:
df['nova coluna'] = df['Pontos']*10
df

            Nome       Classe  Pontos Gênero  nova coluna
0           Jake     Cachorro    10.0      M        100.0
1           Finn       Humano    10.0      M        100.0
2      Bubblegum         Doce     8.0      F         80.0
3      Marceline      Vampira     8.0      F         80.0
4           Lich      Demônio     5.0      M         50.0
5       Ice King         Mago     5.0      M         50.0
6  Fire Princess  Living-Fire     3.0      F         30.0

In [75]:
df['outra coluna'] = df['nova coluna'].cumsum()
df

            Nome       Classe  Pontos Gênero  nova coluna  outra coluna
0           Jake     Cachorro    10.0      M        100.0         100.0
1           Finn       Humano    10.0      M        100.0         200.0
2      Bubblegum         Doce     8.0      F         80.0         280.0
3      Marceline      Vampira     8.0      F         80.0         360.0
4           Lich      Demônio     5.0      M         50.0         410.0
5       Ice King         Mago     5.0      M         50.0         460.0
6  Fire Princess  Living-Fire     3.0      F         30.0         490.0

In [76]:
df['mais uma'] = df['nova coluna'].mean()
df

,Nome,Classe,Pontos,Gênero,nova coluna,outra coluna,mais uma
0,Jake,Cachorro,10.0,M,100.0,100.0,70.0
1,Finn,Humano,10.0,M,100.0,200.0,70.0
2,Bubblegum,Doce,8.0,F,80.0,280.0,70.0
3,Marceline,Vampira,8.0,F,80.0,360.0,70.0
4,Lich,Demônio,5.0,M,50.0,410.0,70.0
5,Ice King,Mago,5.0,M,50.0,460.0,70.0
6,Fire Princess,Living-Fire,3.0,F,30.0,490.0,70.0

#### Deletando uma (ou mais) coluna(s) ou linha(s):

In [77]:
df.drop(['nova coluna', 'outra coluna', 'mais uma'], axis=1, inplace=True)
df

            Nome       Classe  Pontos Gênero
0           Jake     Cachorro    10.0      M
1           Finn       Humano    10.0      M
2      Bubblegum         Doce     8.0      F
3      Marceline      Vampira     8.0      F
4           Lich      Demônio     5.0      M
5       Ice King         Mago     5.0      M
6  Fire Princess  Living-Fire     3.0      F

In [81]:
df.drop([1,3,4] ,axis=0)

            Nome       Classe  Pontos Gênero
0           Jake     Cachorro    10.0      M
2      Bubblegum         Doce     8.0      F
5       Ice King         Mago     5.0      M
6  Fire Princess  Living-Fire     3.0      F

### Seleção condicional

Uma característica importante dos pandas é a seleção condicional usando notação de colchetes, muito semelhante ao numpy:

In [83]:
df['Pontos']>6

0     True
1     True
2     True
3     True
4    False
5    False
6    False
Name: Pontos, dtype: bool

In [84]:
df[df['Pontos']>6]

        Nome    Classe  Pontos Gênero
0       Jake  Cachorro    10.0      M
1       Finn    Humano    10.0      M
2  Bubblegum      Doce     8.0      F
3  Marceline   Vampira     8.0      F

In [90]:
df[(df['Pontos']>6) & (df['Pontos']<9)]  # Operador E

        Nome   Classe  Pontos Gênero
2  Bubblegum     Doce     8.0      F
3  Marceline  Vampira     8.0      F

In [89]:
df[(df['Pontos']<6) | (df['Pontos']>9)]    # Operados OU

            Nome       Classe  Pontos Gênero
0           Jake     Cachorro    10.0      M
1           Finn       Humano    10.0      M
4           Lich      Demônio     5.0      M
5       Ice King         Mago     5.0      M
6  Fire Princess  Living-Fire     3.0      F